; domain
(define (domain emergency)
  (:predicates
   (ambulance ?a) ; Ambulancia
   (at ?a ?l)     ; Si la ambulancia/paciente está en un lugar
   (carry ?p ?a)  ; Si el paciente está en la ambulancia
   (current ?l)   ; La ubicación current de la ambulancua
   (free ?a)      ; Si está vacía la ambulancia
   (location ?l)  ; Los lugares
   (path ?f ?t)   ; Camino entre dos lugares
   (patient ?p))  ; Paciente
  (:action move
           :parameters (?from ?to)
           :precondition (and
                          (current ?from)
                          (location ?from)
                          (location ?to)
                          (path ?from ?to))
           :effect (and
                    (current ?to)
                    (not (current ?from))))                    
  (:action getinto
           :parameters (?p ?l ?a)
           :precondition (and
                          (ambulance ?a)
                          (at ?p ?l)
                          (current ?l)
                          (free ?a)
                          (location ?l)
                          (patient ?p))
           :effect (and
                    (carry ?p ?a)
                    (not (at ?p ?l))
                    (not (free ?a))))        
  (:action getout
           :parameters (?p ?l ?a)
           :precondition (and
                          (ambulance ?a)
                          (carry ?p ?a)
                          (current ?l)
                          (location ?l)
                          (patient ?p))
           :effect (and
                    (at ?p ?l)
                    (free ?a)
                    (not (carry ?p ?a)))))

; problem
(define (problem original)
  (:domain emergency)
  (:objects ambulance hospital L2 L3 L4 patient1 patient2)
  (:init
   (ambulance ambulance)
   (at patient1 L3)
   (at patient2 L4)
   (current hospital)
   (free ambulance)
   (location L2)
   (location L3)
   (location L4)
   (location hospital)
   (path L2 L4)
   (path L2 hospital)
   (path L3 L4)
   (path L4 L2)
   (path L4 L3)
   (path hospital L2)
   (patient patient1)
   (patient patient2))
  (:goal (and
          (at patient1 hospital)
          (at patient2 hospital))))

; plan
1. (move hospital l2)
   deleted: (current hospital)
   added: (current l2)
   goals met: 0 of 2
2. (move l2 l4)
   deleted: (current l2)
   added: (current l4)
   goals met: 0 of 2
3. (getinto patient2 l4 ambulance)
   deleted: (at patient2 l4) (free ambulance)
   added: (carry patient2 ambulance)
   goals met: 0 of 2
4. (move l4 l2)
   deleted: (current l4)
   added: (current l2)
   goals met: 0 of 2
5. (move l2 hospital)
   deleted: (current l2)
   added: (current hospital)
   goals met: 0 of 2
6. (getout patient2 hospital ambulance)
   deleted: (carry patient2 ambulance)
   added: (at patient2 hospital) (free ambulance)
   goals met: 1 of 2
7. (move hospital l2)
   deleted: (current hospital)
   added: (current l2)
   goals met: 1 of 2
8. (move l2 l4)
   deleted: (current l2)
   added: (current l4)
   goals met: 1 of 2
9. (move l4 l3)
   deleted: (current l4)
   added: (current l3)
   goals met: 1 of 2
10. (getinto patient1 l3 ambulance)
   deleted: (at patient1 l3) (free ambulance)
   added: (carry patient1 ambulance)
   goals met: 1 of 2
11. (move l3 l4)
   deleted: (current l3)
   added: (current l4)
   goals met: 1 of 2
12. (move l4 l2)
   deleted: (current l4)
   added: (current l2)
   goals met: 1 of 2
13. (move l2 hospital)
   deleted: (current l2)
   added: (current hospital)
   goals met: 1 of 2
14. (getout patient1 hospital ambulance)
   deleted: (carry patient1 ambulance)
   added: (at patient1 hospital) (free ambulance)
   goals met: 2 of 2
